tutorials/incompressibleFluid/simpleRushtonMRF/constant/rotatingZoneProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      rotatingZoneProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

origin    (0 0 0);
axis      (0 0 1);
omega     5 [rpm];
nonRotatingPatches (); // List of stationary patches inside the rotatingZone

// ************************************************************************* //
