tutorials/incompressibleFluid/simpleRushtonMRF/system/stirrerPower
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the power input from the stirrer patch.

\*---------------------------------------------------------------------------*/

type            surfaceFieldValue;
libs            ( "libfieldFunctionObjects.so" );
log             no;
writeFields     no;
patch           stirrer;
operation       sum;
fields          (stressUSf);
writeControl    outputTime;

// ************************************************************************* //
